rails_bucketlist/app/controllers/archivedcountries_controller.rb

INSERT INTO "archived_countries" ("user_id", "country_id", "best_memory", "best_photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["country_id", 5], ["best_memory", "blah"], ["best_photo", "blah"], ["created_at", 2017-03-01 10:22:29 UTC], ["updated_at", 2017-03-01 10:22:29 UTC]]
---
  def create
    archiveCountryData = archive_country_params()
    archiveCountry = ArchivedCountry.create({
      country_id: archiveCountryData["country_id"],
      user: current_user,
      best_memory: archiveCountryData["best_memory"],
      best_photo: archiveCountryData["best_photo"]
      })