rails_bucketlist/app/controllers/archivedevents_controller.rb

INSERT INTO "archived_events" ("event_id", "user_id", "best_memory", "best_photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event_id", 1], ["user_id", 1], ["best_memory", "Drums"], ["best_photo", ""], ["created_at", 2017-03-01 14:30:39 UTC], ["updated_at", 2017-03-01 14:30:39 UTC]]
---
  def create
    archiveEventData = archive_event_params()
    archiveEvent = ArchivedEvent.create({
      event_id: archiveEventData["event_id"],
      user: current_user,
      best_memory: archiveEventData["best_memory"],
      best_photo: archiveEventData["best_photo"]
      })