rails_bucketlist/app/controllers/archivedexperiences_controller.rb

INSERT INTO "archived_experiences" ("experience_id", "user_id", "best_memory", "best_photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["experience_id", 1], ["user_id", 1], ["best_memory", "Coral"], ["best_photo", ""], ["created_at", 2017-03-01 14:23:42 UTC], ["updated_at", 2017-03-01 14:23:42 UTC]]
---
  def create
    archiveExperienceData = archive_experience_params()
    archiveExperience = ArchivedExperience.create({
      experience_id: archiveExperienceData["experience_id"],
      user: current_user,
      best_memory: archiveExperienceData["best_memory"],
      best_photo: archiveExperienceData["best_photo"]
      })