rails_bucketlist/app/controllers/bucketlistevents_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "bucket_list_events".* FROM "bucket_list_events" WHERE "bucket_list_events"."event_id" = 2
DELETE FROM "bucket_list_events" WHERE "bucket_list_events"."id" = ?  [["id", 2]]
---
  def destroy
      archivedEvent = Event.find(params[:id])
      entryToDelete = BucketListEvent.where({event: archivedEvent})

        if BucketListEvent.destroy(entryToDelete)