rails_bucketlist/app/controllers/bucketlistcountries_controller.rb

SELECT  "bucket_list_countries".* FROM "bucket_list_countries" WHERE "bucket_list_countries"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
---
  def show
    bucketListCountry = BucketListCountry.find(params[:id])

SELECT  "bucket_list_countries".* FROM "bucket_list_countries" WHERE "bucket_list_countries"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
UPDATE "bucket_list_countries" SET "visitLength" = ?, "season" = ?, "updated_at" = ? WHERE "bucket_list_countries"."id" = ?  [["visitLength", nil], ["season", nil], ["updated_at", 2017-02-28 11:40:14 UTC], ["id", 47]]
---
  def update
      object = params
      bucketListCountry = BucketListCountry.find(params[:id])
        if bucketListCountry.update_attributes({
          visitLength: object['visitLength'],
          season: object['season']
          })

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bucket_list_countries".* FROM "bucket_list_countries" WHERE "bucket_list_countries"."country_id" = 1
DELETE FROM "bucket_list_countries" WHERE "bucket_list_countries"."id" = ?  [["id", 1]]
---
  def destroy
      archivedCountry = Country.find(params[:id])
      entryToDelete = BucketListCountry.where({country: archivedCountry})

        if BucketListCountry.destroy(entryToDelete)