rails_bucketlist/app/controllers/bucketlistexperiences_controller.rb

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bucket_list_experiences".* FROM "bucket_list_experiences" WHERE "bucket_list_experiences"."experience_id" = 1
DELETE FROM "bucket_list_experiences" WHERE "bucket_list_experiences"."id" = ?  [["id", 1]]
---
  def destroy
      archivedExperience = Experience.find(params[:id])
      entryToDelete = BucketListExperience.where({experience: archivedExperience})

        if BucketListExperience.destroy(entryToDelete)