rails_bucketlist/app/controllers/countries_controller.rb

  def show
    bucketListCountry = BucketListCountry.find(params[:id])
---
SELECT  "bucket_list_countries".* FROM "bucket_list_countries" WHERE "bucket_list_countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    object = country_params()
    visitLength = object["visitLength"]
    season = object["season"]
    countryObject = {
      name: object["name"],
      region: object["region"],
      imageURL: object["imageURL"],
      mapURL: object["mapURL"]
    }
    newCountry = Country.create(countryObject)
    listCountry = BucketListCountry.create({
      country: newCountry,
      user: current_user,
      visitLength: visitLength,
      season: season
      })
---
INSERT INTO "countries" ("name", "region", "season", "mapURL", "imageURL", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Vietnam"], ["region", "Asia"], ["season", "Spring"], ["mapURL", ""], ["imageURL", ""], ["created_at", 2017-02-27 17:49:10 UTC], ["updated_at", 2017-02-27 17:49:10 UTC]]
INSERT INTO "bucket_list_countries" ("country_id", "user_id", "created_at", "updated_at", "visitLength", "season") VALUES (?, ?, ?, ?, ?, ?)  [["country_id", 56], ["user_id", 17], ["created_at", 2017-02-28 09:51:13 UTC], ["updated_at", 2017-02-28 09:51:13 UTC], ["visitLength", 4], ["season", "Spring"]]