rails_bucketlist/app/controllers/events_controller.rb

SELECT  "bucket_list_events".* FROM "bucket_list_events" WHERE "bucket_list_events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    event = BucketListEvent.find(params[:id])

INSERT INTO "events" ("title", "description", "venue", "mapURL", "created_at", "updated_at", "date", "imageURL") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "bucket_list_events" ("event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 9], ["user_id", 8], ["created_at", 2017-02-26 14:28:12 UTC], ["updated_at", 2017-02-26 14:28:12 UTC]]
---
  def create
    newEvent = Event.create(event_params())
    listEvent = BucketListEvent.create({
      event: newEvent,
      user: current_user
      })