rails_bucketlist/app/controllers/experiences_controller.rb

  def show
    experience = BucketListExperience.find(params[:id])
---
SELECT  "bucket_list_experiences".* FROM "bucket_list_experiences" WHERE "bucket_list_experiences"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    newExperience = Experience.create(experience_params())
    listExperience = BucketListExperience.create({
      experience: newExperience,
      user: current_user
      })
---
INSERT INTO "experiences" ("title", "description", "season", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Surfing"], ["description", "Riding the waves"], ["season", "Summer"], ["created_at", 2017-02-26 14:13:21 UTC], ["updated_at", 2017-02-26 14:13:21 UTC]]
INSERT INTO "bucket_list_experiences" ("experience_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["experience_id", 21], ["user_id", 8], ["created_at", 2017-02-26 14:13:21 UTC], ["updated_at", 2017-02-26 14:13:21 UTC]]